In [2]:
import pandas as pd

## Formatting float column of Dataframe in Pandas

### if we don't wanna change display settings globally but want to format columns of dataframe

In [3]:
data = {'Month': ['January', 'February', 'March', 'April'],
        'Expense': [21525220.653, 31125840.875, 23135428.768, 56245263.942]}
 
# create the dataframe
dataframe = pd.DataFrame(data, columns=['Month', 'Expense'])
dataframe

      Month       Expense
0   January  2.152522e+07
1  February  3.112584e+07
2     March  2.313543e+07
3     April  5.624526e+07

In [7]:
dataframe['Expense']=dataframe['Expense'].map(lambda x: '{:,.2f}'.format(x))

In [8]:
dataframe

      Month        Expense
0   January  21,525,220.65
1  February  31,125,840.88
2     March  23,135,428.77
3     April  56,245,263.94

In [9]:
data = {'Month': ['January', 'February', 'March', 'April'],
        'Expense': [21525220.653, 31125840.875, 23135428.768, 56245263.942]}
 
# create the dataframe
dataframe = pd.DataFrame(data, columns=['Month', 'Expense'])
dataframe

      Month       Expense
0   January  2.152522e+07
1  February  3.112584e+07
2     March  2.313543e+07
3     April  5.624526e+07

### if we  wanna change display settings globally and  format columns of dataframe

In [10]:
pd.options.display.float_format='{:,.2f}'.format

In [11]:
dataframe

      Month       Expense
0   January 21,525,220.65
1  February 31,125,840.88
2     March 23,135,428.77
3     April 56,245,263.94